core/app/Http/Controllers/Admin/AdminController.php

    public function dashboard()
    {
        $page_title = 'Dashboard';

        $widget['total_users'] = User::count();
        $widget['verified_users'] = User::where('status', 1)->count();
        $widget['email_unverified_users'] = User::where('ev', 0)->count();
        $widget['sms_unverified_users'] = User::where('sv', 0)->count();

        // Monthly Deposit & Withdraw Report Graph
        $report['months'] = collect([]);
        $report['deposit_month_amount'] = collect([]);
        $report['withdraw_month_amount'] = collect([]);

        $cryptoCurrency = CryptoCurrency::count();
        $gameLog['log'] = GameLog::count();
        $gameLog['wining'] = GameLog::where('result', 1)->where('status', 1)->count();
        $gameLog['losing'] = GameLog::where('result', 2)->where('status', 1)->count();

        $depositsMonth = Deposit::whereYear('created_at', '>=', Carbon::now()->subYear())
            ->selectRaw("SUM( CASE WHEN status = 1 THEN amount END) as depositAmount")
            ->selectRaw("DATE_FORMAT(created_at,'%M') as months")
            ->orderBy('created_at')
            ->groupBy(DB::Raw("MONTH(created_at)"))->get();

        $depositsMonth->map(function ($aaa) use ($report) {
            $report['months']->push($aaa->months);
            $report['deposit_month_amount']->push(getAmount($aaa->depositAmount));
        });

        $withdrawalMonth = Withdrawal::whereYear('created_at', '>=', Carbon::now()->subYear())->where('status', 1)
            ->selectRaw("SUM( CASE WHEN status = 1 THEN amount END) as withdrawAmount")
            ->selectRaw("DATE_FORMAT(created_at,'%M') as months")
            ->orderBy('created_at')
            ->groupBy(DB::Raw("MONTH(created_at)"))->get();
---
select count(*) as aggregate from `users`
select count(*) as aggregate from `users` where `status` = 1
select count(*) as aggregate from `users` where `ev` = 0
select count(*) as aggregate from `users` where `sv` = 0
select count(*) as aggregate from `crypto_currencies`
select count(*) as aggregate from `game_logs`
select count(*) as aggregate from `game_logs` where `result` = 2 and `status` = 1
select SUM( CASE WHEN status = 1 THEN amount END) as depositAmount, DATE_FORMAT(created_at,'%M') as months from `deposits` where year(`created_at`) >= '2021' group by MONTH(created_at) order by `created_at` asc
select SUM( CASE WHEN status = 1 THEN amount END) as withdrawAmount, DATE_FORMAT(created_at,'%M') as months from `withdrawals` where year(`created_at`) >= '2021' and `status` = 1 group by MONTH(created_at) order by `created_at` asc

        });

        // Withdraw Graph
        $withdrawal = Withdrawal::where('created_at', '>=', \Carbon\Carbon::now()->subDays(30))->where('status', 1)
            ->select(array(DB::Raw('sum(amount)   as totalAmount'), DB::Raw('DATE(created_at) day')))
            ->groupBy('day')->get();
---
select sum(amount)   as totalAmount, DATE(created_at) day from `withdrawals` where `created_at` >= '2022-02-07 13:43:49' and `status` = 1 group by `day`

        });

        // user Browsing, Country, Operating Log
        $user_login_data = UserLogin::whereDate('created_at', '>=', \Carbon\Carbon::now()->subDay(30))->get(['browser', 'os', 'country']);
---
select `browser`, `os`, `country` from `user_logins` where date(`created_at`) >= '2022-02-07'

        })->sort()->reverse()->take(5);


        $payment['total_deposit_amount'] = Deposit::where('status',1)->sum('amount');
        $payment['total_deposit_charge'] = Deposit::where('status',1)->sum('charge');
        $payment['total_deposit_pending'] = Deposit::where('status',2)->count();
        $payment['total_deposit'] = Deposit::where('status',1)->count();

        $paymentWithdraw['total_withdraw_amount'] = Withdrawal::where('status',1)->sum('amount');
        $paymentWithdraw['total_withdraw'] = Withdrawal::where('status',1)->count();
        $paymentWithdraw['total_withdraw_charge'] = Withdrawal::where('status',1)->sum('charge');
        $paymentWithdraw['total_withdraw_pending'] = Withdrawal::where('status',2)->count();

        $latestUser = User::latest()->limit(6)->get();
---
select count(*) as aggregate from `deposits` where `status` = 1
select sum(`charge`) as aggregate from `deposits` where `status` = 1
select count(*) as aggregate from `withdrawals` where `status` = 2
select sum(`charge`) as aggregate from `withdrawals` where `status` = 1
select * from `users` order by `created_at` desc limit 6