core/app/Http/Helpers/helpers.php

function activeTemplate($asset = false)
{
    $gs = GeneralSetting::first(['active_template']);
---
select `active_template` from `general_settings` limit 1

function analytics()
{
    $analytics = Extension::where('act', 'google-analytics')->where('status', 1)->first();
---
select * from `extensions` where `act` = 'google-analytics' and `status` = 1 limit 1

function tawkto()
{
    $tawkto = Extension::where('act', 'tawk-chat')->where('status', 1)->first();
---
select * from `extensions` where `act` = 'tawk-chat' and `status` = 1 limit 1

function fbcomment()
{
    $comment = Extension::where('act', 'fb-comment')->where('status',1)->first();
---
select * from `extensions` where `act` = 'fb-comment' and `status` = 1 limit 1

function getContent($data_keys, $singleQuery = false, $limit = null,$orderById = false)
{
    if ($singleQuery) {
        $content = Frontend::where('data_keys', $data_keys)->latest()->first();
    } else {
        $article = Frontend::query();
        $article->when($limit != null, function ($q) use ($limit) {
            return $q->limit($limit);
        });
        if($orderById){
            $content = $article->where('data_keys', $data_keys)->orderBy('id')->get();
        }else{
            $content = $article->where('data_keys', $data_keys)->latest()->get();
---
select * from `frontends` where `data_keys` = 'banner.content' order by `created_at` desc limit 1
select * from `frontends` where `data_keys` = 'banner.element' order by `created_at` desc limit 4